# Computando estadística agregada/sumativa

Es posible realizar en Pandas diferentes cálculos tipicos sumativos básicos de la estadística:

In [2]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]

GradeList = zip(names,grades)

df = pd.DataFrame(data=GradeList, columns=['Names','Grades'])

df

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

In [3]:
df['Grades'].count() # number of values

5

In [4]:
df['Grades'].mean() # arithmetic average

85.0

In [5]:
df['Grades'].std() # standard deviation

11.067971810589327

In [6]:
df['Grades'].min() # minimum

76

In [7]:
df['Grades'].max() # maximum

99

In [8]:
df['Grades'].quantile(.25) # first quartile

77.0

In [9]:
df['Grades'].quantile(.5) # second quartile

78.0

In [10]:
df['Grades'].quantile(.75) # third quartile

95.0

Varias medidas de tendencia central:

In [11]:
# mean = dividing the sum by the number of values
df['Grades'].mean()

85.0

In [12]:
# median = the middle value if they are sorted in order
df['Grades'].median()

78.0

In [13]:
# mode = the most common single value
df['Grades'].mode()

0    76
1    77
2    78
3    95
4    99
Name: Grades, dtype: int64

Calculando la varianza:

In [14]:
# computes the variance of the values in a column
df['Grades'].var()

122.5

In [15]:
# Calculando la varianza a partir de la desviación estandar:

df['Grades'].std() ** 2

122.49999999999999

Es posible calcular la varianza sobre todas las columnas numéricas:

In [18]:
df.var()

/tmp/ipykernel_1246/1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

Grades    122.5
dtype: float64

## Ej-1 Estadística sumativa 

Para el siguiente Dataframe calcula la estadística sumativa para los siguientes datos. Crea el dataset correspondiente:

In [19]:
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

# Estadística sumativa sobre filtros de renglones

In [20]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bs = [1,1,0,0,1]
ms = [2,1,0,0,0]
phd = [0,1,0,0,0]
GradeList = zip(names,grades,bs,ms,phd)

df = pd.DataFrame(data=GradeList, columns=['Name','Grade','BS','MS','PhD'])

df

      Name  Grade  BS  MS  PhD
0      Bob     76   1   2    0
1  Jessica     95   1   1    1
2     Mary     77   0   0    0
3     John     78   0   0    0
4      Mel     99   1   0    0

Contando el número de personas que no tienen doctorado:

In [22]:
df.loc[df['PhD']==0]['PhD'].count()

4

Calculando la calificación promedio de los que no tienen doctorado:

In [23]:
df.loc[df['PhD']==0]['Grade'].mean()

82.5

# Ej-2 Calculando promedios con dataframes con filtros

Para el siguiente dataframe calcula el promedio de los estudiantes que tienen grado de maestría:

In [25]:
import pandas as pd

names = ['Bob','Jessica','Mary','John', 'Mel','Sam','Cathy','Henry','Lloyd']
grades = [76,95,77,78,99,84,79,100,73]
bs = [1,1,0,0,1,1,1,0,1]
ms = [2,1,0,0,0,1,1,0,0]
phd = [0,1,0,0,0,2,1,0,0]

GradeList = zip(names,grades,bs,ms,phd)

df = pd.DataFrame(data=GradeList, columns=['Names','Grades','BS','MS','PhD'])

df

     Names  Grades  BS  MS  PhD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0
5      Sam      84   1   1    2
6    Cathy      79   1   1    1
7    Henry     100   0   0    0
8    Lloyd      73   1   0    0